---
type: WorksharingTooltipInfo
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# WorksharingTooltipInfo

`Autodesk.Revit.DB.WorksharingTooltipInfo` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetRequesters | 2012 | `public IList < string > GetRequesters ()` |
| Property | Creator | 2012 | `public string Creator { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | LastChangedBy | 2012 | `public string LastChangedBy { get ; }` |
| Property | Owner | 2012 | `public string Owner { get ; }` |